EDT/УТ/src/Documents/УчетОборудования/УчетОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетОборудования</name>
  <registerRecords>InformationRegister.УчетОборудования</registerRecords>
  <registerRecords>AccumulationRegister.УчетОстатковОборудования</registerRecords>
  <registerRecords>InformationRegister.КомплектыОборудования</registerRecords>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостоянияЕдиницыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>НаемныйЭкипаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаНаДлительныйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВводаДанных</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортКомплекта</name>
      <type>
        <types>CatalogRef.новаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановитьКомплектным</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбрудованиеПовреждено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПовреждения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТекущийКомплектОборудования</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.Оборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/КомплектыОборудования/КомплектыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомплектыОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </resources>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/УчетОборудования/УчетОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетОборудования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЕдиницыОборудования</name>
    <type>
      <types>EnumRef.СостоянияЕдиницыОборудования</types>
    </type>
  </resources>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>ОборудованиеПовреждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВыдачаНаДлительныйСрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/УчетОборудования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр КомплектыОборудования
	Движения.КомплектыОборудования.Записывать = Истина;
	Движения.КомплектыОборудования.Очистить();
	
	// регистр УчетОборудования
	Движения.УчетОборудования.Записывать = Истина;
	Движения.УчетОборудования.Очистить();
	
	Для Каждого ТекСтрокаСписокОборудования Из СписокОборудования Цикл
		
		Если ТекСтрокаСписокОборудования.УстановитьКомплектным Тогда
			Запись = Движения.КомплектыОборудования.Добавить();
			Запись.Период = ТекСтрокаСписокОборудования.ВремяВводаДанных;
			Запись.Транспорт = Транспорт;
			Запись.ТипОборудования = ТекСтрокаСписокОборудования.Оборудование.МодельОборудования.ТипОборудования;
			Запись.Оборудование = ТекСтрокаСписокОборудования.Оборудование;
			Запись.ФизЛицо = ФизЛицо;
			Запись.Пользователь = Пользователь;
		КонецЕсли; 
		
		Запись2 = Движения.УчетОборудования.Добавить();
		Запись2.Период = ТекСтрокаСписокОборудования.ВремяВводаДанных;
		Запись2.Оборудование = ТекСтрокаСписокОборудования.Оборудование;
		Запись2.ФизЛицо = ФизЛицо;
		Запись2.Рейс = Рейс;
		Запись2.СостояниеЕдиницыОборудования = СостояниеОборудования;
		Запись2.Транспорт = Транспорт;
		Запись2.ОборудованиеПовреждено = ТекСтрокаСписокОборудования.ОбрудованиеПовреждено;
		Запись2.Пользователь = Пользователь;
		//Асеев 10.04.2024 (Задача № 5255)>>>
		Запись2.ВыдачаНаДлительныйСрок = ВыдачаНаДлительныйСрок;
		//Асеев 10.04.2024 (Задача № 5255)<<<
		Запись2.Регион = Регион;
		
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Добавить(Регион);
	ПроверяемыеРеквизиты.Добавить(ФизЛицо);
	ПроверяемыеРеквизиты.Добавить(СостояниеОборудования);
	ПроверяемыеРеквизиты.Добавить(Рейс);
	ПроверяемыеРеквизиты.Добавить(Транспорт);
	
КонецПроцедуры
